In [1]:
#Analysis of Time Series

import pandas as pd

In [4]:
##Extract csvs into dataframes
conf_data = "csse_covid_19_data/csse_covid_19_time_series/time_series_19-covid-Confirmed.csv"
conf_df = pd.read_csv(conf_data)
conf_df.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/7/20,3/8/20,3/9/20,3/10/20,3/11/20,3/12/20,3/13/20,3/14/20,3/15/20,3/16/20
0,NaN,Thailand,15.0000,101.0000,2,3,5,7,8,8,...,50,50,50,53,59,70,75,82,114,147
1,NaN,Japan,36.0000,138.0000,2,1,2,2,4,4,...,461,502,511,581,639,639,701,773,839,825
2,NaN,Singapore,1.2833,103.8333,0,1,3,3,4,5,...,138,150,150,160,178,178,200,212,226,243
3,NaN,Nepal,28.1667,84.2500,0,0,0,1,1,1,...,1,1,1,1,1,1,1,1,1,1
4,NaN,Malaysia,2.5000,112.5000,0,0,0,3,4,4,...,93,99,117,129,149,149,197,238,428,566

In [6]:
col_labels=['Province/State','Country/Region','Lat','Long','Date']
newc_df=pd.melt(conf_df,id_vars=['Province/State','Country/Region','Lat','Long'])
newc_df.head()

  Province/State Country/Region      Lat      Long variable  value
0            NaN       Thailand  15.0000  101.0000  1/22/20      2
1            NaN          Japan  36.0000  138.0000  1/22/20      2
2            NaN      Singapore   1.2833  103.8333  1/22/20      0
3            NaN          Nepal  28.1667   84.2500  1/22/20      0
4            NaN       Malaysia   2.5000  112.5000  1/22/20      0

In [7]:
newc_df['Status']='Confirmed'
newc_df.head()

  Province/State Country/Region      Lat      Long variable  value     Status
0            NaN       Thailand  15.0000  101.0000  1/22/20      2  Confirmed
1            NaN          Japan  36.0000  138.0000  1/22/20      2  Confirmed
2            NaN      Singapore   1.2833  103.8333  1/22/20      0  Confirmed
3            NaN          Nepal  28.1667   84.2500  1/22/20      0  Confirmed
4            NaN       Malaysia   2.5000  112.5000  1/22/20      0  Confirmed

In [5]:
italy_df = new_df.loc[new_df["Country/Region"] == "Italy",:]
italy_df.head()

     Province/State Country/Region   Lat  Long variable  value
16              NaN          Italy  43.0  12.0  1/22/20      0
458             NaN          Italy  43.0  12.0  1/23/20      0
900             NaN          Italy  43.0  12.0  1/24/20      0
1342            NaN          Italy  43.0  12.0  1/25/20      0
1784            NaN          Italy  43.0  12.0  1/26/20      0

In [6]:
values=[]
for x in italy_df['value']:
    values.append(x)
type(values)

list

In [11]:
result = values.sort()
print(result)

None

In [ ]:
it_chg_list=[]
values = []
for x in italy_df['value']:
    values.append(x)
values

In [ ]:
values.sort(ascending=False)
values

In [ ]:
x=0
for x in values:
    y=x+1
    change=values[y]-values[x]
    it_chg_list.append(change)
it_chg_list

In [ ]:
grouped = new_df.groupby(['Country/Region'])
grouped_df=pd.DataFrame(grouped)
grouped_df.head()

In [ ]:
for i, row in grouped_df.iterrows():
    trythis=pd.DataFrame(row)
    for i, row2 in trythis.iterrows():
        if row2[1] > 0:
            row2['Day']==1
        else:
            row2['Day']==0
trythis.head()

In [ ]:
#grouped = new_df.groupby(['Country/Region'])
sum=0
for i in range(len(grouped)): 
    if grouped['value'][i] > 0: 
        Type_new[i]=sum+1
    else:
        Type_new[i]= 0


grouped.head()

In [ ]:
sum=0
for i in range(len(new_df)): 
    if new_df["value"][i] > 0: 
        Type_new[i]=sum+1
  
    elif data["Type"][i] == "Fire": 
        Type_new[i]="Orange"
  
    elif data["Type"][i] == "Water": 
        Type_new[i]="Blue"
  
    else: 
        Type_new[i]= data["Type"][i]

In [ ]:
sum=0
for i in range(len(data)): 
    if data["Type"][i] == "Grass": 
        Type_new[i]="Green"
  
    elif data["Type"][i] == "Fire": 
        Type_new[i]="Orange"
  
    elif data["Type"][i] == "Water": 
        Type_new[i]="Blue"
  
    else: 
        Type_new[i]= data["Type"][i]

In [ ]:
sum=0
for index, row in new_df.iterrows():
    if row['value']>0:
        row['Day Count']=sum+1
    else: row['Day Count']=0
new_df.head()

In [ ]:
china_df = time_df.loc[time_df["Country/Region"] == "Mainland China",:]
china_df.head()

In [ ]:
day1=china_df['1/22/20'].sum()
day1

In [ ]:
forthis=time_df['Country/Region']
if x in forthis:
    particles.index(x+1)

In [ ]:
# mylist=[]
# for i in time_df.itertuples(): 
#     mylist.append(i)
# pd.DataFrame(mylist)

In [ ]:
for index, row in time_df.iterrows():
    print(index, row)

In [ ]:
for index, row in time_df.iterrows():
    for x in row.iteritems():
        mylist.append(x[1])
mylist

In [ ]:
df=pd.DataFrame(mylist[0:52])
df['China']='China'
df

In [ ]:
mylist=[]

for index, row in time_df.iterrows():
    for x in row.iteritems():
        mylist.append(x)
mylist

In [ ]:
vdf=pd.DataFrame(columns=['State','Country','Lat','Long','Date','Day Count','Confirmed'])
vdf

In [ ]:
print(mylist[2])

In [ ]:
trythis=pd.DataFrame(mylist)
trythis

In [ ]:

data = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]} 
for x in mylist:
    df['']

In [ ]:
newdf=pd.DataFrame(mylist)
newdf

In [ ]:
for index, row in time_df.iterrows():
    data = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]} 
    print(row['Province/State'])
    print()

In [ ]:
for i, j in time_df.iterrows():
    x=j
    x.split()
    mylist = []
    mylist.append(x)
    print(j)
type(mylist)

In [ ]:
mylist.split()

In [ ]:
df = pd.DataFrame(mylist, columns=range(52))
df

In [ ]:
df = pd.DataFrame(mylist, columns = ['Name', 'Age'])
for x in mylist:
    newdf['State'].append(x[0])
newdf.head()

In [ ]:
df = j[0]

In [ ]:
for i, j in df.iterrows(): 
    print(i, j) 
    print()

In [ ]:
for j in range(10):
    df = df.append({'key_%s'%random.choice('abcde'): j}, ignore_index=True)

In [ ]:
for key, value in time_df.iteritems(): 
    mykeys=key
    myvalue=value

mylist = myvalue.tolist()
dtype_after = type(myvalue) 
print(dtype_after)
mylist

In [ ]:
for i, j in time_df.iterrows():
    print(i,j)
    print()

In [ ]:
for i, j in time_df.iterrows(): 
    country=j[1]
    print(country)

In [ ]:
eachrow={}
for i, j in time_df.iterrows(): 
    eachrow.append(key="i",value="j")
print(eachrow)